{"podcast_details": {"podcast_title": "Big Data Beard", "episode_title": "Ensuring resilience for industrial IOT with Arcus Data and Splunk", "episode_image": "https://d3t3ozftmdmh3i.cloudfront.net/staging/podcast_uploaded_nologo/5609476/817917982c03ba91.jpeg", "episode_transcript": " You're listening to the big data beard. Hi everybody. This is the big data beard podcast live from Splunk's.com 23. I'm Corey men joined by my co-hosts, Kyle and Brett. Brett, by the way, welcome to being back in the, the, uh, the comp Splunk world. And it's amazing to be back. Awesome. Been a two year hiatus and just love being back. Absolutely. You look great in a black t-shirt man. Well, why don't you? Black is just my color. So one of the things that the team here has really enjoyed, uh, this year, walking around the floor at docconf is seeing a lot of the innovation that's happening with this new Splunk edge hub product that Splunk's launching. And, uh, so we invited Josh to join us from Argus data to talk a little about what they're doing is we hear that this, this edge hub is, is cool, but it's made real and super cool by companies like Argus that are Argus that are partners, Josh, tell us a little about yourself and maybe what is, uh, what's Argus is like superpower. Yeah, thanks Corey. Um, Argus data is an analytics solutions Friday based in Seattle. We've been in business for going on five years now. Um, we focus on building solutions on top of Splunk as a primary platform. Uh, I myself was at Splunk from 2008 to late 2015. So, uh, know a lot about the company, the technology, et cetera. And we've actually been working with the edge hub device before it was called the edge hub device. So, um, I won't refer to the older name, but trying to probably get those out of the, the marketing profile for it. But, uh, so Argus data does a lot of work in customizing Splunk to address a number of different challenges in industry vertical challenges like energy and utility or healthcare, or even just in, you know, kind of use case, uh, arenas security, uh, IOT, et cetera. Uh, edge hub has been a really interesting new development for us with Splunk. We are really excited at the additional visibility our customers are provided by this device. We have been trying for a long time to make sense of this data that's being generated by oftentimes, you know, 10, 20 year old devices and in places that really don't have good networking, you know, connectivity, and don't have a lot of money on top of that. And so the additional visibility we're seeing with the edge hub is pretty incredible, um, what we're also excited about, we've kind of taken a few stabs at how to accomplish this, but getting AI at the edge, right? So getting some of that capability out to these environments that really just aren't usually able to get that, um, pretty, pretty exciting. And again, from a cost perspective, you know, before it was just cost prohibitive to get anywhere near these types of capabilities and what Splunk has been able to do and what we've been able to help package up here is a pretty compelling overall offering. Um, last I'd probably say, you know, on the sort of theme of resilience, right? If you're looking at being resilient, obviously you need to be able to respond quickly, these devices out in these, you know, sort of, uh, IOT, you know, spaces definitely don't fall into that category traditionally, right? The IT inventory is usually, uh, stuff that's quicker to respond on. This I think is going to allow a lot of organizations to move that response time up for things that are out at the edge. Yeah, absolutely. One of the things you mentioned there is, uh, AI. So congratulations on Buzzword Bingo. You were able to work it in. That is incredibly another additional pin. The fact that you didn't say generative AI, it hurts my feelings really. Um, so, so tell me though that, because this, the whole concept, you kind of summarized it there, but I want to pull on it. The concept that Edge Hub is, it's actually about bringing like data that we typically don't see operators in like the IT and security space having access to that data and that's a different silo. Why, why is it so important to break down those walls? Yeah, I mean, I think, you know, it's funny. I, uh, I'll give a shout out to a buddy of mine that I got hired at Splunk a long time back and, uh, did a lot to pioneer in this space at Splunk, Brian Gilmore, but, um, Brian, Brian, Brian, IOT, hang around here. Shout out Brian, miss you brother. Brian love you, man. Um, he was a customer of mine working on a large project at Chevro for Chevron subcontract at, uh, Eglin air force space, doing energy, uh, efficiency work with a building systems integrator. And I think helped sort of open up my mind to the fact that really it's not necessarily IOT or IT. It's everything connected to the internet now. Right. So it's just the internet, right? Internet of things. I don't know, maybe someday it'll go away here soon. So, you know, I look at these devices as basically siloed for now, just like, let's say prior to Splunk and technologies in this space, certain IT systems couldn't talk to other certain IT systems and they were siloed. Right. So Splunk's doing a great job breaking down some of the walls on another silo. Just like it's done for over a decade. Right. Although it makes me think though, uh, did anybody watch Mr. Robot, the TV show? Yeah. You remember what was the hack at the end? Oh yeah. How they got in. Yeah. You know, you know, what was it? Thermostat. Yeah. So it's like a great example of like that, the things at the edge. You hit Brian Gale, you hit Brian Brian's use case literally on the head. That was what he really as the subcontractor. What the hack? It was not the thermostat hacking, but tracking, you know, thermostats basically on large campuses, right? Energy and temperature. So yeah, we had a conversation previously with somebody working in this kind of similar space. And they said that there's like the vast majority of, you know, breaches today actually are coming through the physical, the OT side, less through like cyber, the typical way we think about attacks happening. So interesting that you have to, you have to secure that edge. Yeah. It's your weakest link, right? I mean, whether it's someone who goes through the phishing campaign over email or the person who's in, you know, non-technical role fixing the thermostats or other sort of building controls, right? Like it's always going to be your weakest link, right? Yeah. And you mentioned resiliency earlier, and that's a big theme for the conference this year and business resiliency is just super important. You know, why and how is getting data insights from these industrial IOT endpoints super important for that business resiliency? Yeah. I don't, I don't think any organization can be resilient without having visibility into the critical technology that they're running. And so, you know, there's numerous examples of some of the early projects with Edge Hub. I mean, I think one that stands out is when we've done some work in and out of over the years, Mars, right. Using this for actually the physical machinery that makes all the things we love to eat, right. And so when you think about resiliency, well, you know, while they don't have visibility into these critical machines that generate, you know, millions of dollars of revenue, can't really be resilient when that goes down and you need it to come back up or keep it up, right? I mean, ideally, you're giving, getting signs of things needing preventative maintenance more so than, you know, break fix after it happens. So yeah, resiliency for me starts with visibility, right? You can't, can't have something be resilient if it's not visible. Yeah. So candy bars, candy bars. I wasn't sure if you were going like Mars, the chocolate company or Mars, the planet. Yeah, I shouldn't have meant that. I thought you could tell by the belly. It was Mars, that Mars. I want to make sure too, because they do pet food as well, right? So they do. Huge. Yeah. So Ian Murphy, another shout out to Consul and our team, principal consultant did a lot of cool work with their ServiceNow integration. And I'd have to ask what area, if any kind of group was it tied into the pet food side, I hope not, because I'm more interested in, can I get some free candy out of this? 100%. Yeah. M&Ms, Mars bars. I'm sure, you know, they have a bunch of other things under the umbrella, but really cool company and really cool use cases. So yeah. And we got to keep M&M safe. Yeah. Protect M&M's at all costs. Yes. I have a vested interest. It's a national treasure. Yes. Yeah. And so stepping away from chocolate and candy a little bit. Endog. Why? Endog food. Question for you. I was reading through your website a little bit and some use cases and I wanted to hear your perspective a little bit around the use cases. A little bit around the use cases and scenarios for education. Yeah. I mean, I think it's interesting in education, you know, there's in particular a lot of investment in research, right? And so when you think about R&D in the form of either government funded or, you know, other self-funded by the university, one thing that we've kind of piloted it a little bit is looking at commercial refrigeration. So there's been several stories where, you know, refrigeration units either by accident, like we were talking about, you know, thermostat gets hacked. Well, what if it's more innocuous than that? Just simple, somebody makes a mistake. So, you know, research university has refrigeration unit turned off. Well, that, that buzzing or that alert was really loud. So janitor decided I'm going to get rid of that while I'm doing the work. Doesn't turn back on. I mean, there's million dollar plus lawsuit going on right now at a university in New York where that exact thing happened. And again, that's just sort of a bizarre mistake, but if it was, you know, something more malicious and intent, like you shut down some of this refrigeration equipment and it's going to cost quite a lot of money in any lab. And so coming off of COVID and all the research being done, whether you're, you know, biotech or pharmaceutical or in the university, I think the university labs between, you know, refrigeration and other kind of physical equipment that they have to maintain can gain a lot of visibility at the edge. Right. So these devices that are typically not things tied to their IT, you know, infrastructure or even something like Splunk can get pulled in and, you know, whether that's HVAC, like we were talking about, or commercial refrigeration, I think the number of different sensors that you are able to connect with the edge are going to be pretty great in terms of visibility. Absolutely. So that's one thing I want to kind of talk about a little bit that I don't know that we've actually explained really well so far. What's the edge? Yeah. So like the Edge Hub story is that you have partners like yourselves, like incredible value added consultancies building a capability on top of Splunk. Right, Splunk is the enterprise platform for data analytics that we all know and understand. This Edge Hub thing, we haven't really talked about what this thing is, and we should have grabbed one of those for the video. They look pretty cool, yeah. So tell me, you know about this there, tell folks at a high level, what is the Edge Hub? Yeah, I would look at it as a, you know, computing device that can sit at the places where you normally don't have the processing power, the flexibility to gather a number of different types and structures of data and then make sense of it actually, you know, at the device itself rather than just being in the environment to send somewhere else, right? So there's a good amount of sort of pre-processing and AI that can be done at the device itself. You can deploy obviously a fleet of these across different locations. You know, we've seen everything from data center, kind of closet monitoring, right? Temperature, humidity, fan speed, all the stuff that you need to keep the IT side going, but we're in the real world, quote unquote, right? The physical side, too. Things like in the energy and utility space where we focus a lot, we might be concerned with what's unfortunately become a growing concern, physical attacks on energy substations and infrastructure. So, you know, Edge Hub as a device has the ability to do things like people detection, sound, light. And so if we're in one of our examples, you can see if you come by the partner pavilion booth, we can show a demo of where people are detected on a, you know, dark night, light is detected, a loud sound goes along with that light, and you can correlate that there was a gunshot basically, you know, at substation equipment that took out some power. So, you know, something like Edge Hub enables new types of data, new sort of senses to be turned on, right? Like Zumblunk's really good at machine generated data, not a human sense necessarily, but this gives it more of that kind of human sensory input, right? That's the idea of that Edge, that Edge AI, right? How can you push processing out instead of having to traverse video back to process it later, why not have it processed at the Edge and actually get the event data out of there? So your goal there is basically bringing better visibility so you can see what's actually happening. And like anything that we're trying to do with Splunk, it's about, you know, accelerating the ability to go act on something interesting. So that's cool. You know, I was really excited to see how pretty the device is. It is a really nice device too. Yeah. What's your favorite feature on the Edge Hub? I like the people detection. You know, it's fun because we've played around with it in a number of different ways and I think we're just continuing to scratch the surface on, you know, how that works. I mean, you know, anything Splunk, we always think correlation, right? And so people detection or any of these sensors by themselves aren't really all that exciting. Other people do it. Other technologies can do this side or the other, but I always, you know, look at Splunk as really more valuable for the correlation than any one single data set in it. And so I think same thing here where people detection is a cool feature and there are tons of other singular cool features, but it's really the combination of these things on the power of Splunk that makes it impactful. Yeah. It's that context, right? It's adding that rich context. And as we add more context for more data sources, then it makes it easier to enable, like you said, that visibility that's half-wired for resilience. Man, it's a fantastic story. So one thing I would say is like, if you're at dot-com this week, make sure you head over to that source Pavilion. That's the expo floor where fantastic partners like ArcS Data are featured in the Edge Hub Central where you can actually see the physical devices. You can interact with them. You can see some demos of these use cases brought to life. So make sure you're definitely checking out that source Pavilion and definitely check out ArcS data.io. Is that the right website? That's it. You got it. All right. Well, head over to ArcS data.io to learn more. Do one thing here. Sorry, my son made me a what? Oh, it's I got some on my face. Oh, it's real. I just want to check. Okay. It's taped on something on my face. Yeah. Thank you. You're real. That's the first. The first time I beard has been got to go for it. But I appreciate that. Well, I get to ask Santa for something for Christmas now, right? I don't know if you get a I'm not going to sit on your lap or anything, though. This is where we cut it off, right? And with that, folks, we want to encourage you to be sure to stay tuned to the big data beard and thanks to Splunk for hosting us here and for helping these videos find their way to you. And if you're enjoying it, please comment and like below. Find us out there on YouTube and LinkedIn and give us some feedback on anything you think is interesting in the world of big data and AI. I'm Corey Men. Thanks for listening to the big data podcast."}, "podcast_summary": "In this podcast episode, the hosts interview Josh from Argus Data to discuss the new Splunk edge hub product. Argus Data is an analytics solutions provider based in Seattle and they focus on building solutions on top of Splunk. The edge hub is a computing device that allows for data processing and analysis at the edge, where there is limited connectivity and resources. Josh highlights the importance of breaking down silos between IT and OT (operational technology) and the need for visibility and resiliency in organizations. Use cases for the edge hub include monitoring temperature and humidity in data centers, people detection in energy substations, and research in education, such as monitoring refrigeration units in university labs. Overall, the edge hub provides additional visibility and processing capabilities in previously inaccessible environments.", "podcast_guest": "Josh", "podcast_highlights": "Summary:\nIn this podcast episode, the hosts discuss the new Splunk Edge Hub product and its potential applications with guest Josh from Argus Data. Argus Data is an analytics solutions provider that specializes in building solutions on top of Splunk. They have been working with the Edge Hub device, which is a computing device that allows for data processing and analysis at the edge of networks, where connectivity and resources are limited. The Edge Hub offers additional visibility and AI capabilities in environments that previously couldn't access such technology. This is especially important for industries like energy, utility, healthcare, and security. The hosts and guest also discuss the importance of breaking down silos and enabling access to data from industrial IoT endpoints for business resiliency and security. They highlight the vulnerability of the physical side of networks and the need for visibility into critical technology in order to ensure resilience. Use cases for Edge Hub include monitoring commercial refrigeration in research facilities and detecting physical attacks on energy infrastructure. The Edge Hub device provides new types of data and sensory input, improving visibility and accelerating the ability to respond to events. The hosts recommend visiting the Edge Hub Central at the Splunk.com conference to see demos and learn more about the product.\n\nKey insights:\n- The Edge Hub device allows for data processing and analysis at the edge of networks, where resources and connectivity are limited.\n- AI capabilities at the edge enhance visibility and enable analysis in environments that previously couldn't access such technology.\n- Breaking down silos and accessing data from industrial IoT endpoints is crucial for business resiliency and security.\n- The physical side of networks is a vulnerable point and needs to be monitored and secured.\n- Use cases for Edge Hub include monitoring commercial refrigeration in research facilities and detecting physical attacks on energy infrastructure.\n\nCritical questions:\n- Why is it important to break down silos and enable access to data from industrial IoT endpoints?\n- How does visibility into critical technology improve business resiliency?\n- What are some other use cases for Edge Hub in different industries?\n- How does Edge Hub improve response time to events at the edge of networks?\n- What are the potential security benefits of using Edge Hub for monitoring and detection?"}