{"podcast_details": {"podcast_title": "Optimal Living Daily: Mental Health & Motivation", "episode_title": "2871: On Not Falling Into Temptation by Joshua Becker of Becoming Minimalist", "episode_image": "https://megaphone.imgix.net/podcasts/6fb682f0-2003-11ec-83c0-17f79b1a801b/image/OLD-Cover-Living-3000.jpg?ixlib=rails-4.3.1&max-w=3000&max-h=3000&fit=crop&auto=format,compress", "episode_transcript": " This is Optimal Living Daily, episode 2871, On Not Falling Into Temptation, by Joshua Becker of becomingminimalist.com. And I'm Justin Molyke. I'm going to jump right into today's post as we optimize your life. On Not Falling Into Temptation, by Joshua Becker of becomingminimalist.com. Quote, it's easier to stay out than get out. Mark Twain. Temptations surround us every day. Sometimes the temptations are great, other times small. Sometimes the temptations are many, other times few. But whether it be to cheat on our diets, our budgets, our tests, our taxes, or our spous, there are forces at work against our ideals nearly everywhere we look in this world. They call us to sacrifice the long-term goals that we have set for our life and exchange them for short-term pleasure. They are avoidable, and falling prey to their empty promises can have drastic negative effects on our lives. So how then can we resist falling into the temptations that detract us? What foundations can we put into our lives to keep our lofty ideals rather than fall into the short-term pleasures that keep us from them? Surprisingly, whether the temptations are great or small, I'm finding that the principles remain the same. Number one, we can know the end goal and why we desire it. It's wise to not underestimate the importance of keeping a healthy, big-picture mentality and not falling into temptation. We desire a strong marriage and healthy family for our children. We desire to get out of debt, stay sober, live an honest life of integrity, or intentionally live with fewer possessions. Each of these goals offer our lives significance in a way that cannot be achieved by falling into the cheap gain or fleeting pleasure that so many worldly temptations promise. Oftentimes we can't have both. Therefore, knowing the end goal and the reason why we desire it is abundantly helpful in achieving it. Number two, we can recognize the temptations that keep tripping us up. Each of us have influences in our lives that trip us up more than others, and the sooner we recognize those traps, the better. Whether the end goal be losing weight, accomplishing a major achievement, or being the father you've always wanted to be, some goals remain elusive only because of our inability to resist a specific temptation that keeps us from achieving them. All men and women take the time to clearly recognize and articulate the temptation that seems to have an unbreakable hold on their lives. Number three, we can develop an exit strategy. When temptation arises and the pull is greater than can be avoided, follow an exit strategy. Maybe it's a phone call to a friend, a photo of your children in your wallet, a specific quote that inspires you, or a powerful mental reminder of what you may lose. But developing an exit strategy prior to the temptation can become the fire route exit that keeps you from getting burnt by the flames. Number four, we can avoid the propaganda that gives temptation life in your mind. Since deciding to live an intentional life with fewer possessions, I've become much more aware of the number of messages or advertisements that encourage me to buy more. They surround me on every street corner, every television channel, and nearly every publication I pick up. Their message is always the same, buy more, be happier. They can be very convincing, and the more I put myself in the path of their message, the more susceptible I am to believe it. As a result, I've tried to avoid their propaganda as much as possible and give them less space in my mind. This principle relates to far more than just buying things at a local department store, it also relates to how we view money, power, and the people around us. Number five, we can find some help. Too often we fall into the prideful trap of thinking we can just handle it on our own, never mind the fact that we have tried for years to overcome a particular temptation on our own with no success. We've tried on our own and still can't get out of debt. We've tried on our own and still can't get physically healthy. We've tried on our own and still can't remain truly faithful to our partner. Pride is among the most self-destructive habits any of us can harbor because it always leads to a fall, as most of us can attest. Find some help to overcome the temptations in your life that trip you up. Find a friend that has fought the same battle. Find a group that convenes for the purpose of finding the very solution for which you're searching. Or find a higher power that gives you the strength to live the life you've always wanted to live. However you accomplish this piece, somehow, somewhere, find some help. Number six, we can understand that our choices affect more than ourselves. No man lives on an island. Well, maybe some do, but most don't. Our choices affect the lives of others. Oftentimes the short-term decisions that we make today have long-term consequences for those who are closest to us, our friends, our spouses, our children, even our grandchildren in some cases. Negative life choices leave a lasting mark and legacy for years to come, and so do positive life choices. If overcoming negative temptations for our own life's sake is not enough motivation, maybe reminding ourselves that our choices influence the ones we love the most, will be. Number seven, we can always flee. Perhaps the most valuable foundation for avoiding the pitfalls of negative temptation is the simple realization that we can always leave. Whether it be the kitchen, the department store, the car dealership, the bar, or the seductive situation that we find ourselves in, we can always turn back around and walk out the door. We may miss the short-term fleeting pleasure, but the big picture rewards are almost always worth it. And number eight, we can get back up and start again. Moments of weakness come, and to avoid them at all times is virtually impossible. We take two steps forward, but one step back. We cheat on our diets, we take another drink, we compromise our values, we fall down. But to stay down is to let the negative forces win and to let temptation become our master. So we get back up. We give it another shot. We turn back to our goals, our friends, our family, and we start again. It's never over until it's over. And luckily so, because if you're anything like me, you have lofty goals and an important legacy that you desire to leave behind. You just listened to the post titled, On Not Falling Into Temptation, by Joshua Becker of becomingminimalist.com. This episode is brought to you by Special K. However hectic life gets, the fuel you choose matters. So Special K has made two new irresistible varieties. Special K high protein with real almonds, a rich chocolate flavor, and 20 grams of protein. And Special K with zero grams of sugar, packed with cinnamon flavor, 20 grams of protein, and two net carbs. Visit specialk.com to find a retailer near you. Thank you to Joshua for the post. I like that this list of ideas has many different methods to try. So what I mean by this is, fleeing is action. It's running away. But a good running away because sometimes that's the fastest and simplest solution. But another one in his list is knowing the end goal and why we desire it. This is sort of the opposite of running away. It's diving deeper and requires a lot of introspection, maybe some journaling. Then there's number five, getting some help. That's an action like fleeing is an action, but it's much different. It's actually talking with someone else and relying on others. To me these are all different where maybe one works really well for us or it's certain tactics in certain situations. The good news is that there's plenty to choose from. The key is trial and error and doing our best and coming from a good place. And of course being there for others when they need it too. So thank you again to Joshua for this one. Thank you for listening and also for sharing the show with others who you think could benefit from this. That really goes a long way to help keep all of this going. And have a great rest of your day and I'll see you tomorrow over the weekend where your optimal life awaits."}, "podcast_summary": "In this podcast, Joshua Becker explores the topic of resisting temptations that can detract us from achieving our long-term goals. He discusses various principles we can apply to overcome these temptations. Firstly, it is important to know the end goal and why we desire it. Understanding the significance and meaning behind our goals can help us resist short-term pleasures. Secondly, identifying the specific temptations that trip us up is crucial. Recognizing our weaknesses allows us to develop strategies to avoid them. Thirdly, having an exit strategy in place when temptations arise can help us navigate difficult situations. This could involve reaching out to a friend, having a photo or quote as a reminder, or visualizing potential negative consequences. Fourthly, Becker advises avoiding propaganda or messages that encourage us to give in to temptations. This applies not only to buying material possessions but also how we view money, power, and relationships. Fifthly, seeking help is important in overcoming temptations. Becker suggests finding someone who has faced similar battles or joining a group focused on finding solutions. Additionally, he emphasizes the importance of understanding that our choices impact not only ourselves, but also those around us. The long-term consequences of our decisions can have a lasting effect on loved ones. Lastly, Becker reminds us that we always have the choice to flee from tempting situations and that even when we stumble, we can always get back up and start again. Overall, these principles offer guidance on resisting short-term temptations and staying focused on our long-term goals.", "podcast_guest": "Joshua Becker", "podcast_highlights": "Summary: In this podcast episode, Joshua Becker discusses the topic of not falling into temptation. He acknowledges that temptations are present in various aspects of our lives, such as cheating on diets, budgets, tests, taxes, or relationships. These temptations can lead us to sacrifice our long-term goals for short-term pleasure. To resist falling into these temptations, Becker suggests several foundations. First, we should know our end goal and why we desire it, as it offers significance that cannot be achieved through short-term pleasures. Second, we should recognize the specific temptations that hinder us from achieving our goals. Third, we can develop an exit strategy to navigate through temptation when it arises. Fourth, we should avoid the propaganda that promotes temptation in our minds. Fifth, seeking help from others who have faced similar battles can be beneficial. Sixth, we should remember that our choices affect not only ourselves but also those we love. Seventh, we can always choose to flee from temptations. Finally, if we do fall into temptation, we can get back up, start again, and continue pursuing our goals and leaving behind a meaningful legacy.\n\nKey Insights:\n- Temptations are always present in our lives and can lead us away from our long-term goals.\n- Knowing our end goal and the reason why we desire it is crucial in resisting temptations.\n- Recognizing specific temptations that hinder our progress is important for overcoming them.\n- Developing an exit strategy and avoiding temptation-related propaganda can help us stay on track.\n- Seeking help from others and understanding the impact of our choices on those we love can provide support and motivation.\n- Fleeing from temptations and starting again after falling into them is crucial for long-term success.\n\nCritical Questions:\n1. How can we effectively identify and articulate the specific temptations that hinder our progress?\n2. What strategies can we employ to avoid falling prey to temptation-related propaganda?\n3. In what ways can we find help and support in overcoming our personal temptations?\n4. How can we navigate the balance between short-term pleasures and long-term goals?\n5. What mindset or actions can help us bounce back and start again after falling into temptation?"}